app/views/collaborators/index.html.erb

SELECT  1 AS one FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ? AND "users"."id" = ? LIMIT ?  [["wiki_id", 56], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    </h4>
    <% if @wiki.users.include?(user) %>