app/views/wikis/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 51]]
---
     <h4>Collaborators</h4>
        <% @wiki.users.each do |user| %>