app/controllers/collaborators_controller.rb

INSERT INTO "collaborators" ("user_id", "wiki_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["wiki_id", 56], ["created_at", "2017-06-18 19:06:40.988165"], ["updated_at", "2017-06-18 19:06:40.988165"]]
---
    def create
      @collaborator = @wiki.collaborators.new(user_id: params[:user_id])

      if @collaborator.save

SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 2]]
---
    def destroy
      @collaborator = Collaborator.find(params[:id])

      if @collaborator.destroy