app/controllers/downgrade_controller.rb

  def create
  @user = current_user
  @user.role = 'standard'

  current_user.wikis.each do |wiki|
    wiki.update_attribute(:private, false)

  end

    if @user.save
---
SELECT "wikis".* FROM "wikis" WHERE "wikis"."user_id" = ? ORDER BY created_at DESC  [["user_id", 8]]
UPDATE "wikis" SET "private" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["private", "f"], ["updated_at", "2017-06-17 18:18:29.836745"], ["id", 43]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2017-06-12 02:45:24.607025"], ["id", 1]]