app/controllers/wikis_controller.rb

SELECT "wikis".* FROM "wikis" ORDER BY created_at DESC
SELECT "wikis".* FROM "wikis" WHERE "wikis"."private" = ? ORDER BY created_at DESC  [["private", "f"]]
---
  def index

    if current_user.premium? || current_user.admin?
      @wikis = Wiki.all
    else
      @wikis = Wiki.where(private: false)

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 48], ["LIMIT", 1]]
---
  def show
    @wiki = Wiki.find(params[:id])

INSERT INTO "wikis" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This is a public wiki"], ["body", "This is a public wiki "], ["user_id", 1], ["created_at", "2017-06-17 18:12:17.394745"], ["updated_at", "2017-06-17 18:12:17.394745"]]
---
  def create
     @wiki = current_user.wikis.new(wiki_params)
    #  authorize @wiki

     if @wiki.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 48], ["LIMIT", 1]]
---
  def edit
    @wiki = Wiki.find(params[:id])

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 48], ["LIMIT", 1]]
UPDATE "wikis" SET "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["body", "I hope so! Even with edits! "], ["updated_at", "2017-06-10 18:42:16.905136"], ["id", 52]]
---
  def update
    @wiki = Wiki.find(params[:id])
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]
    authorize @wiki

    if @wiki.update(wiki_params)

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 56], ["LIMIT", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 3]]
---
  def destroy
    @wiki = Wiki.find(params[:id])
    authorize @wiki

    if @wiki.destroy